Repository: 23years/comeonin
Catalog: po/*/LC_MESSAGES/default.po
Languages: de_de, fr_fr, ja_jp

source: The password should be at least %{min_len} characters long.
de_de: Das Kennwort sollte mindestens %{min_len} Zeichen lang sein.
fr_fr: Le mot de passe doit contenir au moins %{min_len} caractères.
ja_jp: パスワードは%{min_len}文字以上である必要があります。

source: The password should contain at least one number and one punctuation character.
de_de: Das Kennwort sollte mindestens eine Ziffer und ein Satzzeichen enthalten.
fr_fr: Le mot de passe doit contenir au moins un chiffre et un signe de ponctuation.
ja_jp: パスワードは1字以上の数字と記号が含まれている必要があります。

source: The password you have chosen is weak because it is easy to guess. Please choose another one.
de_de: Das gewählte Kennwort ist zu leicht zu erraten. Bitte wählen Sie ein anderes.
fr_fr: Le mot de passe que vous avez choisi est trop facile de deviner. Veuillez choisir un autre mot de passe.
ja_jp: 入力されたパスワードは推測が容易で強度が不十分です。違うものを指定してください。

source: The salt is the wrong length.
de_de: Die Länge des Salts ist falsch.
fr_fr: La longeur du salt est incorrecte.
ja_jp: ソルトの長さが正しくありません。

source: We could not find the password. The password key should be either :password or "password".
de_de: Kein Kennwort gefunden; es sollte mit dem Key :password oder "password" übergeben werden.
fr_fr: Nous ne pouvons pas trouver le mot de passe. La clé doit être :password ou "password".
ja_jp: パスワードが見つかりません。キーが:passwordか"password"である必要があります。

source: Wrong number of rounds.
de_de: Die Anzahl der Runden ist falsch.
fr_fr: Le nombre du rounds est incorrect.
ja_jp: 不正なラウンド数です。

source: Wrong type. The password and hash need to be strings.
de_de: Falscher Typ: Kennwort und Hash müssen Strings sein.
fr_fr: Le type est incorrect. Le mot de passe et le hash doit être de type string.
ja_jp: 不正な型です。パスワードとハッシュは文字列である必要があります。

source: Wrong type. The password and salt need to be strings.
de_de: Falscher Typ: Kennwort und Salt müssen Strings sein.
fr_fr: Le type est incorrect. Le mot de passe et le salt doit être de type string.
ja_jp: 不正な型です。パスワードとソルトは文字列である必要があります。

source: Wrong type. The salt needs to be a string.
de_de: Falscher Typ: Salt muss ein String sein.
fr_fr: Le type est incorrect. Le salt doit être de type string.
ja_jp: 不正な型です。ソルトは文字列である必要があります。

source: Invalid character: %{val}
de_de: Ungültiges Zeichen: %{val}
fr_fr: Caractère non valide. %{val}

source: invalid character: %{val}
ja_jp: 不正な文字です: %{val}
